In [1]:
import pandas as pd

In [2]:
xls_2017 = pd.ExcelFile("cvhabitatges_2017.xls")

In [3]:
anual_values = pd.read_excel(xls_2017, 't05')

In [4]:
anual_values.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 83 entries, 0 to 82
Data columns (total 21 columns):
Compravendes d'habitatge registrades per barris. Dades trimestrals    3 non-null object
Unnamed: 1                                                            75 non-null object
Unnamed: 2                                                            0 non-null float64
Unnamed: 3                                                            75 non-null object
Unnamed: 4                                                            77 non-null object
Unnamed: 5                                                            76 non-null object
Unnamed: 6                                                            76 non-null object
Unnamed: 7                                                            76 non-null object
Unnamed: 8                                                            0 non-null float64
Unnamed: 9                                                            77 non-null object
Unnamed: 10                                                           76 non-null object
Unnamed: 11                                                           76 non-null object
Unnamed: 12                                                           76 non-null object
Unnamed: 13                                                           0 non-null float64
Unnamed: 14                                                           77 non-null object
Unnamed: 15                                                           76 non-null object
Unnamed: 16                                                           76 non-null object
Unnamed: 17                                                           0 non-null float64
Unnamed: 18                                                           77 non-null object
Unnamed: 19                                                           76 non-null object
Unnamed: 20                                                           76 non-null object
dtypes: float64(4), object(17)
memory usage: 13.7+ KB

In [5]:
anual_values.drop(columns = ['Compravendes d\'habitatge registrades per barris. Dades trimestrals',
       'Unnamed: 2', 'Unnamed: 4', 'Unnamed: 5', 'Unnamed: 6',
       'Unnamed: 7', 'Unnamed: 8', 'Unnamed: 9', 'Unnamed: 10', 'Unnamed: 11',
       'Unnamed: 12', 'Unnamed: 13', 'Unnamed: 17', 'Unnamed: 18', 'Unnamed: 19',
       'Unnamed: 20'], inplace = True)

In [6]:
anual_values.head()

,Unnamed: 1,Unnamed: 3,Unnamed: 14,Unnamed: 15,Unnamed: 16
0,NaN,NaN,NaN,NaN,NaN
1,NaN,NaN,Preu total (milers d'euros),NaN,NaN
2,Dte.,Barris,Total,Habitatge\n nou,Habitatge\n usat
3,NaN,NaN,NaN,NaN,NaN
4,BARCELONA,NaN,334.15,377.702,329.59

In [7]:
anual_values.rename(columns = {'Unnamed: 15' : 'New_flats', 'Unnamed: 16' :'Second_hand_flats', 'Unnamed: 1' : 'District', 'Unnamed: 3' : 'Neighbourhood', 'Unnamed: 14' : 'Total_price'}, inplace = True)

In [11]:
anual_values.drop([0, 1, 2, 3, 4, 5], inplace = True) #rest index

In [12]:
anual_values = anual_values.reset_index(drop = True)

In [14]:
anual_values.head()

,District,Neighbourhood,Total_price,New_flats,Second_hand_flats
0,1,1. el Raval,240.348,292.5,240.037
1,1,2. el Barri Gòtic,472.712,799.507,424.041
2,1,3. la Barceloneta,197.723,192.762,198.19
3,1,"4. Sant Pere, Santa Caterina i la Ribera",314.27,375.775,310.402
4,2,5. el Fort Pienc,400.427,507.486,383.211

In [18]:
for count, x in enumerate(anual_values['Total_price']):
    print (count, type(x))

0 <class 'float'>
1 <class 'float'>
2 <class 'float'>
3 <class 'float'>
4 <class 'float'>
5 <class 'float'>
6 <class 'float'>
7 <class 'float'>
8 <class 'float'>
9 <class 'float'>
10 <class 'float'>
11 <class 'float'>
12 <class 'float'>
13 <class 'float'>
14 <class 'float'>
15 <class 'float'>
16 <class 'float'>
17 <class 'float'>
18 <class 'float'>
19 <class 'float'>
20 <class 'float'>
21 <class 'float'>
22 <class 'float'>
23 <class 'float'>
24 <class 'float'>
25 <class 'float'>
26 <class 'float'>
27 <class 'float'>
28 <class 'float'>
29 <class 'float'>
30 <class 'float'>
31 <class 'float'>
32 <class 'float'>
33 <class 'float'>
34 <class 'float'>
35 <class 'float'>
36 <class 'float'>
37 <class 'float'>
38 <class 'float'>
39 <class 'float'>
40 <class 'float'>
41 <class 'int'>
42 <class 'float'>
43 <class 'float'>
44 <class 'float'>
45 <class 'float'>
46 <class 'float'>
47 <class 'float'>
48 <class 'float'>
49 <class 'float'>
50 <class 'float'>
51 <class 'float'>
52 <class 'float'>
53 <class 'int'>
54 <class 'float'>
55 <class 'float'>
56 <class 'float'>
57 <class 'int'>
58 <class 'float'>
59 <class 'float'>
60 <class 'float'>
61 <class 'float'>
62 <class 'float'>
63 <class 'float'>
64 <class 'float'>
65 <class 'float'>
66 <class 'float'>
67 <class 'float'>
68 <class 'float'>
69 <class 'float'>
70 <class 'float'>
71 <class 'float'>
72 <class 'float'>
73 <class 'str'>
74 <class 'float'>
75 <class 'float'>
76 <class 'float'>

In [30]:
anual_values['Total_price'][41]

0

In [31]:
anual_values = anual_values['Total_price'].drop(anual_values[anual_values.Total_price == 0].index)

In [32]:
anual_values['Total_price'][41]

KeyError: 'Total_price'

In [146]:
anual_values['Total_price'] = anual_values['Total_price'].apply(lambda x: x.replace('-', '-999' ) if type(x)==str else x)

In [15]:
anual_values['Total_price2'] = anual_values['Total_price1'].astype('float64')

KeyError: 'Total_price1'

In [149]:
anual_values['Total_price2'].apply(lambda x: None if x==-999 else x )

6    240.35€
7    472.71€
8    197.72€
9    314.27€
10   400.43€
11   255.80€
12   519.83€
13   372.22€
14   339.59€
15   297.92€
16   260.52€
17    99.12€
18   166.28€
19   235.13€
20   263.33€
21   288.13€
22   251.47€
23   338.29€
24   417.34€
25   369.88€
26   889.95€
27   391.33€
28   690.08€
29   805.69€
30   612.32€
31   583.58€
32   523.24€
33   337.19€
34   205.82€
35   310.94€
       ...
49   172.47€
50   171.01€
51   107.83€
52   114.38€
53   174.99€
54   128.64€
55   106.75€
56   116.81€
57   131.97€
58    73.59€
59    97.00€
60    77.06€
61   176.47€
62   142.30€
63   265.00€
64   144.38€
65   211.98€
66   231.64€
67   189.52€
68   350.32€
69   341.76€
70   348.22€
71   289.80€
72   492.10€
77   271.42€
78   138.30€
79      nan€
80      nan€
81      nan€
82      nan€
Name: Total_price2, Length: 73, dtype: float64

In [152]:
anual_values['Total_price'][47]

0

In [126]:
anual_values.tail()

,District,Neighbourhood,Total_price,New_flats,Second_hand_flats,Total_price1
78,10,73. la Verneda i la Pau,138.30€,134.22€,138.75€,138.30€
79,NaN,NC,-,-,-,138.30€
80,NaN,NaN,NaN,NaN,NaN,NaN
81,NaN,NaN,NaN,NaN,NaN,NaN
82,NaN,NaN,NaN,NaN,NaN,NaN

In [107]:
anual_values.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 77 entries, 6 to 82
Data columns (total 6 columns):
District             73 non-null object
Neighbourhood        74 non-null object
Total_price          74 non-null object
New_flats            74 non-null object
Second_hand_flats    74 non-null object
Total_price1         74 non-null object
dtypes: object(6)
memory usage: 4.2+ KB

In [55]:
anual_values.drop(columns = ['New_flats',
       'Second_hand_flats'], inplace = True)

In [131]:
anual_values.tail()

,District,Neighbourhood,Total_price,New_flats,Second_hand_flats,Total_price1
78,10,73. la Verneda i la Pau,138.30€,134.22€,138.75€,138.30€
79,NaN,NC,-,-,-,
80,NaN,NaN,NaN,NaN,NaN,NaN
81,NaN,NaN,NaN,NaN,NaN,NaN
82,NaN,NaN,NaN,NaN,NaN,NaN

In [132]:
anual_values.drop([73, 74, 75, 76], inplace = True)

In [133]:
anual_values.tail()

,District,Neighbourhood,Total_price,New_flats,Second_hand_flats,Total_price1
78,10,73. la Verneda i la Pau,138.30€,134.22€,138.75€,138.30€
79,NaN,NC,-,-,-,
80,NaN,NaN,NaN,NaN,NaN,NaN
81,NaN,NaN,NaN,NaN,NaN,NaN
82,NaN,NaN,NaN,NaN,NaN,NaN

In [57]:
mean_2017_0 = anual_values.groupby(['District']).mean()

In [43]:
mean_2017.isnull().sum()

          Total_price
District
1             306.26€
2             364.30€
3             237.79€
4             559.06€
5             601.04€
6             329.73€
7             178.51€
8             126.85€
9             219.31€
10            313.60€

In [58]:
mean_2017_0

          Total_price
District
1             306.26€
2             364.30€
3             237.79€
4             559.06€
5             601.04€
6             329.73€
7             178.51€
8             126.85€
9             219.31€
10            313.60€

In [16]:
districts_list = ['Ciutat Vella', 'Eixample', 'Sants-Montjuïc', 'Les Corts', 'Sarrià-Sant Gervasi', 
             'Gràcia', 'Horta-Guinardó', 'Nou Barris', 'Sant Andreu', 'Sant Martí']

In [17]:
mean_2017.insert(0, 'District', districts_list)

In [18]:
del mean_2017.index.name

In [19]:
mean_2017['Total_price'] = mean_2017['Total_price'].apply(lambda x : x*1000)

In [20]:
pd.options.display.float_format = '{:,.2f}€'.format

In [21]:
mean_2017

               District  Total_price
1          Ciutat Vella  306,263.39€
2              Eixample  364,298.11€
3        Sants-Montjuïc  237,785.09€
4             Les Corts  559,055.60€
5   Sarrià-Sant Gervasi  601,039.97€
6                Gràcia  329,729.80€
7        Horta-Guinardó  178,508.56€
8            Nou Barris  126,845.36€
9           Sant Andreu  219,305.19€
10           Sant Martí  313,599.29€

In [24]:
mean_2017.rename(columns = {'Total_price' : '2017'}, inplace = True)

In [25]:
mean_2017.to_csv('mean_2017.csv')